InformationRegisters/СогласующиеЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СогласующиеЦенНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерСогласующего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СогласующиеЦенНоменклатуры/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Номер = 1 По 3 Цикл
		СтрокаСогласующего = Согласующие.Добавить();
		СтрокаСогласующего.НомерСогласующего = Номер;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СогласующиеЦенНоменклатуры.НомерСогласующего КАК НомерСогласующего,
	|	СогласующиеЦенНоменклатуры.Пользователь КАК Пользователь,
	|	СогласующиеЦенНоменклатуры.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.СогласующиеЦенНоменклатуры КАК СогласующиеЦенНоменклатуры";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строки = Согласующие.НайтиСтроки(Новый Структура("НомерСогласующего", Выборка.НомерСогласующего));
		Если Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Строки[0], Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСогласующих(Команда)
	
	ТекстОшибки = "";
	Если Не ЗаписатьСогласующихНаСервере(ТекстОшибки) Тогда
		Сообщить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Сообщить("Согласующие записаны.");
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьСогласующихНаСервере(ТекстОшибки)
	
	Номера = Новый Соответствие;
	Для Каждого СтрокаСогласующего Из Согласующие Цикл
		
		Если СтрокаСогласующего.НомерСогласующего < 1 Или СтрокаСогласующего.НомерСогласующего > 3 Тогда
			ТекстОшибки = "Номер согласующего должен быть от 1 до 3.";
			Возврат Ложь;
		КонецЕсли;
		
		Если Номера[СтрокаСогласующего.НомерСогласующего] <> Неопределено Тогда
			ТекстОшибки = "Номер согласующего " + СтрокаСогласующего.НомерСогласующего + " указан дважды.";
			Возврат Ложь;
		КонецЕсли;
		Номера.Вставить(СтрокаСогласующего.НомерСогласующего, Истина);
		
		Если Не ЗначениеЗаполнено(СтрокаСогласующего.Пользователь) Тогда
			ТекстОшибки = "Не заполнен пользователь согласующего " + СтрокаСогласующего.НомерСогласующего + ".";
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Номера.Количество() <> 3 Тогда
		ТекстОшибки = "Нужно заполнить трех согласующих.";
		Возврат Ложь;
	КонецЕсли;
	
	Набор = РегистрыСведений.СогласующиеЦенНоменклатуры.СоздатьНаборЗаписей();
	Для Каждого СтрокаСогласующего Из Согласующие Цикл
		Запись = Набор.Добавить();
		Запись.НомерСогласующего = СтрокаСогласующего.НомерСогласующего;
		Запись.Пользователь = СтрокаСогласующего.Пользователь;
		Запись.АдресЭлектроннойПочты = СокрЛП(СтрокаСогласующего.АдресЭлектроннойПочты);
	КонецЦикла;
	Набор.Записать();
	
	Возврат Истина;
	
КонецФункции
